{"modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "encoder_lstm/kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "encoder_lstm/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "encoder_lstm/bias", "shape": [400], "dtype": "float32"}, {"name": "decoder_lstm/kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "decoder_lstm/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "decoder_lstm/bias", "shape": [400], "dtype": "float32"}, {"name": "decoder_dense/kernel", "shape": [100, 2001], "dtype": "float32"}, {"name": "decoder_dense/bias", "shape": [2001], "dtype": "float32"}]}]}